{
  "overviews": {
    "3": {
      "content": "<h2 class=\"wp-block-heading\">What You Will Learn?</h2>\n<p>After completing this course, a trainee will be able to:&nbsp;</p>\n<ul class=\"wp-block-list\">\n<li>Understand the fundamentals of graphic design, color theory, and typography.</li>\n<li>Master industry-standard tools like Adobe Photoshop, Illustrator, and Canva.</li>\n<li>Design eye-catching social media posts, logos, and marketing materials.</li>\n<li>Develop a strong visual identity and branding for businesses.</li>\n<li>Learn composition techniques for professional-grade designs.</li>\n<li>Work on real-world design projects to build a portfolio.</li>\n<li>Optimize designs for print and digital platforms.</li>\n<li>Explore freelancing opportunities and start earning as a designer.</li>\n</ul>\n<p>At Learn.pk, we believe that great design speaks louder than words. Whether you're looking to kickstart a creative career or enhance your existing skills, this course will guide you through the essentials of modern graphic design.</p>\n<h2 class=\"wp-block-heading\">Course Overview</h2>\n<p>This course is designed to transform beginners into professional designers. You will explore essential design principles, develop hands-on skills with top design tools, and learn how to create stunning visuals for digital and print media.</p>\n<h2 class=\"wp-block-heading\">Key Learning Outcomes</h2>\n<ul class=\"wp-block-list\">\n<li><strong>Design Fundamentals</strong>&nbsp;&ndash; Master the principles of design, composition, and color theory.</li>\n<li><strong>Professional Tools</strong>&nbsp;&ndash; Learn Photoshop, Illustrator, Canva, and other key design software.</li>\n<li><strong>Branding &amp; Identity</strong>&nbsp;&ndash; Create logos, business cards, and complete brand kits.</li>\n<li><strong>Social Media &amp; Marketing</strong>&nbsp;&ndash; Design compelling visuals for ads, posts, and campaigns.</li>\n<li><strong>Portfolio &amp; Freelancing</strong>&nbsp;&ndash; Build a strong portfolio and find freelance opportunities.</li>\n</ul>\n<h2 class=\"wp-block-heading\">Course Benefits</h2>\n<ul class=\"wp-block-list\">\n<li><strong>Creative &amp; Practical Learning</strong>&nbsp;&ndash; Gain hands-on experience through real-world projects.</li>\n<li><strong>High-Demand Skillset</strong>&nbsp;&ndash; Graphic design is essential for businesses, marketing, and branding.</li>\n<li><strong>Freelancing &amp; Career Growth</strong>&nbsp;&ndash; Unlock earning opportunities by offering design services.</li>\n<li><strong>Flexible &amp; Accessible</strong>&nbsp;&ndash; Learn at your own pace with expert guidance.</li>\n</ul>\n<h2 class=\"wp-block-heading\">Join the Graphic Designing Course Now!</h2>\n<p>Turn your creativity into a career! Start learning today and design your way to success.</p>",
      "updatedAt": "2025-09-25T17:26:33.850Z"
    }
  }
}